# PathReinTypen1 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinTypen1 Property
ParameterTypeId Class See Also
---
"Primary Bar - Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinTypen1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinTypen1 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinTypen1 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace